# a = {} #объявление словаря
# print(type(a))
# a = {'1':123, 2:'hello'} #'1','2'-ключи, 123 и 'hello'  - значения

# a['3'] = [1,2,3,4,5] ?
# a[3] = (2,3,4,5,6,7) ?
# print(a['3'][0]) ?

# d=dict(short='dict', long ='dictionary') #short,long - ключи
# d_2 = dict([(1,1),(2,'tree')]) #словарь из списка с двумя кортежами преобр.в словарь
# print(d)
# print(d_2)

# d = dict.fromkeys(['a','b']) #создание из ключей, без значения
# print(d)
# d_2 = dict.fromkeys(['a','b'],100) #создание через метод fromkeys
# print(d_2)

# d={a: a**2 for a in range(7)} #генератор словаря
# print(d)

# a = [1,2,3,4,5]
# b = ['hello','world','sun','daddy','mummy']
# d = dict(zip(a,b)) #преобразование в словарь двух списков
# print(d)

# a = {1:'123', 2:'hello'}
# print(a[1]) #получение значения словаря, в квадр.скобках - ключ

a = {'1':123, 2:'hello'}
a[3]=(5,7,9,1,2)
print(a[3][4]) #ключи могут быть стораками! при печати ставятся скобки!

